<H1> Pandas DataFrame </H1>

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

<p><b> "numpy.random.seed" makes number static. so, when you run next time random.randn then numbers will not chnage  </b></p>

In [4]:
np.random.seed(0)
np.random.randn(3,4)

array([[ 1.76405235,  0.40015721,  0.97873798,  2.2408932 ],
       [ 1.86755799, -0.97727788,  0.95008842, -0.15135721],
       [-0.10321885,  0.4105985 ,  0.14404357,  1.45427351]])

<h3> DataFrame contains "index","columns" ,"rows" as shown in example in which "W","X","Y","Z" are Pandas individual series.
All rows and columns are Pandas Series in itself</h3>

In [5]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184
E  1.532779  1.469359  0.154947  0.378163

<h3> there are two different ways to call/print the column . One is df["index"] or df.index </h3>

In [16]:
df['W']

A    0.761038
B    1.494079
C   -2.552990
D    2.269755
E    1.532779
Name: W, dtype: float64

In [17]:
df.X

A    0.121675
B   -0.205158
C    0.653619
D   -1.454366
E    1.469359
Name: X, dtype: float64

In [11]:
df['Z']

A    0.333674
B   -0.854096
C   -0.742165
D   -0.187184
E    0.378163
Name: Z, dtype: float64

In [18]:
type(df['Z'])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

<p><b> For printing multiple column in DataFrame, we can call like this : df[['W',"Y"]]</b></p>

In [22]:
df[['W','Y']]    #multidomentionsl matrix

          W         Y
A  0.761038  0.443863
B  1.494079  0.313068
C -2.552990  0.864436
D  2.269755  0.045759
E  1.532779  0.154947

<p><b>We can make a new column by adding two columns as well</b></p>

In [24]:
df['new'] = df['W'] + df['Y']

In [25]:
df['new']

A    1.204901
B    1.807147
C   -1.688554
D    2.315513
E    1.687727
Name: new, dtype: float64

In [26]:
df

          W         X         Y         Z       new
A  0.761038  0.121675  0.443863  0.333674  1.204901
B  1.494079 -0.205158  0.313068 -0.854096  1.807147
C -2.552990  0.653619  0.864436 -0.742165 -1.688554
D  2.269755 -1.454366  0.045759 -0.187184  2.315513
E  1.532779  1.469359  0.154947  0.378163  1.687727

<p><b> We can drop a column by specifying axis name and "inplace" should be true, otherwise it won't be deleted permanently</b></p>

In [28]:
df.drop(labels='new',axis=1)

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184
E  1.532779  1.469359  0.154947  0.378163

In [29]:
df

          W         X         Y         Z       new
A  0.761038  0.121675  0.443863  0.333674  1.204901
B  1.494079 -0.205158  0.313068 -0.854096  1.807147
C -2.552990  0.653619  0.864436 -0.742165 -1.688554
D  2.269755 -1.454366  0.045759 -0.187184  2.315513
E  1.532779  1.469359  0.154947  0.378163  1.687727

<h3> Here, you can see, by using drop function, we have our column live in DataFrame without use of "inplace" method </h3>

In [32]:
df.drop('new',axis=1,inplace=True)

In [33]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184
E  1.532779  1.469359  0.154947  0.378163

<h3> In DataFrame, we have row's axis =0 and columns's axis is 1 by default. Thus, if we donot specify while dropping a row, then also it will get deleted </h3>

In [34]:
df.drop('E')

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [35]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184
E  1.532779  1.469359  0.154947  0.378163

In [36]:
df.drop('E',inplace=True)

In [37]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [38]:
df.shape

(4, 4)

<h3> There are two ways to call rows in Pandas. One is DataFrame.loc["index_Name"] and other is to call index location with syntax DataFrame.iloc[index_number] ; 
   <p> loc="location based index location"
    iloc= "integer based index location" </P></h3>

In [41]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096

In [42]:
df.loc["A"]

W    0.761038
X    0.121675
Y    0.443863
Z    0.333674
Name: A, dtype: float64

In [43]:
df.iloc[0]

W    0.761038
X    0.121675
Y    0.443863
Z    0.333674
Name: A, dtype: float64

In [44]:
df.iloc[1]

W    1.494079
X   -0.205158
Y    0.313068
Z   -0.854096
Name: B, dtype: float64

<h3> like NumPy , we can call a particular index with rows and column combination. Here, one example is shown as row and column name is provided and combination we have </h3>

In [45]:
df.loc['B','Y']

0.31306770165090136

In [48]:
df.loc['A','X']

0.12167501649282841

In [49]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [50]:
df.loc[['A','C'], ['X','Z']]    #combination or subset of rows and columns

          X         Z
A  0.121675  0.333674
C  0.653619 -0.742165

<h3> conditional DataFrame </h3>

In [51]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [52]:
df >0

       W      X     Y      Z
A   True   True  True   True
B   True  False  True  False
C  False   True  True  False
D   True  False  True  False

In [55]:
booldf = df >0

In [56]:
booldf

       W      X     Y      Z
A   True   True  True   True
B   True  False  True  False
C  False   True  True  False
D   True  False  True  False

In [57]:
df[booldf]

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079       NaN  0.313068       NaN
C       NaN  0.653619  0.864436       NaN
D  2.269755       NaN  0.045759       NaN

In [58]:
df[df > 0]

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079       NaN  0.313068       NaN
C       NaN  0.653619  0.864436       NaN
D  2.269755       NaN  0.045759       NaN

In [64]:
df['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [66]:
df.loc['A'] >0

W    True
X    True
Y    True
Z    True
Name: A, dtype: bool

<h3> you will get rows which are fit in condition with True value, Syntax : DataFrame[DataFrame[Index]]

In [67]:
df['X'] >0

A     True
B    False
C     True
D    False
Name: X, dtype: bool

In [69]:
df[df['X']>0]       #here you have rows and columns which has only True values of the condition

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
C -2.552990  0.653619  0.864436 -0.742165

In [71]:
resultdf=df[df['Z']<0]

In [72]:
resultdf

          W         X         Y         Z
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [73]:
resultdf['X']

B   -0.205158
C    0.653619
D   -1.454366
Name: X, dtype: float64

<h3> we can perform similar operation in one line </h3>

In [74]:
df[df['Z']<0]['X']

B   -0.205158
C    0.653619
D   -1.454366
Name: X, dtype: float64

In [76]:
df[df['Z']<0][['X','Y']]

          X         Y
B -0.205158  0.313068
C  0.653619  0.864436
D -1.454366  0.045759

In [77]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [80]:
df[(df['W']>1) & (df['Y']>0)]

          W         X         Y         Z
B  1.494079 -0.205158  0.313068 -0.854096
D  2.269755 -1.454366  0.045759 -0.187184

In [83]:
df[df['Y']>0]

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [87]:
df[(df['W']>0) & (df['Y']>0)] #For 'AND' condition in pandas, we are using '&' operator

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
D  2.269755 -1.454366  0.045759 -0.187184

In [89]:
df[(df['W']>0) | (df['Y']>1)] #For 'OR' condition, we are using '|' operator"

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
D  2.269755 -1.454366  0.045759 -0.187184

<h3> to reset index, we use "DataFrame.reset_index()" but to change it permanently you need to give "inplace=True" 

    <p><b> df.reset_index(inplace=True)</b></p></h3>

In [90]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

In [91]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.761038  0.121675  0.443863  0.333674
1     B  1.494079 -0.205158  0.313068 -0.854096
2     C -2.552990  0.653619  0.864436 -0.742165
3     D  2.269755 -1.454366  0.045759 -0.187184

In [93]:
df

          W         X         Y         Z
A  0.761038  0.121675  0.443863  0.333674
B  1.494079 -0.205158  0.313068 -0.854096
C -2.552990  0.653619  0.864436 -0.742165
D  2.269755 -1.454366  0.045759 -0.187184

<h3> to add a new index or column in existing DataFrame </h3>

In [94]:
new_index='CA NY OR SE'.split()

In [95]:
new_index

['CA', 'NY', 'OR', 'SE']

In [96]:
df['States']=new_index

In [97]:
df

          W         X         Y         Z States
A  0.761038  0.121675  0.443863  0.333674     CA
B  1.494079 -0.205158  0.313068 -0.854096     NY
C -2.552990  0.653619  0.864436 -0.742165     OR
D  2.269755 -1.454366  0.045759 -0.187184     SE

In [98]:
df.set_index('States')   #this is not permamnent as we havenot used df.set_index('States',inplace=True)

               W         X         Y         Z
States
CA      0.761038  0.121675  0.443863  0.333674
NY      1.494079 -0.205158  0.313068 -0.854096
OR     -2.552990  0.653619  0.864436 -0.742165
SE      2.269755 -1.454366  0.045759 -0.187184

In [99]:
df

          W         X         Y         Z States
A  0.761038  0.121675  0.443863  0.333674     CA
B  1.494079 -0.205158  0.313068 -0.854096     NY
C -2.552990  0.653619  0.864436 -0.742165     OR
D  2.269755 -1.454366  0.045759 -0.187184     SE